{
    "ir_version": "1.0.0",
    "schema_version": "1.0.0",
    "semantics_version": "1.0.0",
    "certificate_version": "1.0.0",
    "layer": "core",
    "nodes": [
        {
            "type": "operator",
            "id": "op_000001",
            "name": "identity",
            "params": {}
        },
        {
            "type": "literal",
            "id": "lit_000002",
            "value": 42
        }
    ],
    "output": {
        "type": "compose",
        "id": "comp_000003",
        "sequence": [
            { "type": "variable", "id": "var_000004", "name": "x" },
            {
                "type": "iterate",
                "id": "iter_000005",
                "iterations": { "mode": "fixed_count", "count": 1 },
                "operator": { "type": "operator", "id": "op_000001", "name": "identity", "params": {} },
                "input": { "type": "literal", "id": "lit_000002", "value": 42 }
            }
        ]
    }
}
