{
    "ir_version": "1.0.0",
    "schema_version": "1.0.0",
    "semantics_version": "1.0.0",
    "certificate_version": "1.0.0",
    "layer": "core",
    "nodes": [
        {
            "type": "literal",
            "id": "invalid_id",
            "value": 123
        }
    ],
    "output": { "type": "literal", "id": "invalid_id", "value": 123 }
}
